{
    "intents": [
      {
        "tag": "greeting",
        "patterns": [
          "hello!",
          "hi there",
          "nice to meet you",
          "hey",
          "Good day",
          "hola",
          "wassup"
        ],
        "responses": [
          "Hello there!",
          "Hello, how can i help you?",
          "Hello! How may I assist you today?"
        ]
      },
      {
        "tag": "thanks",
        "patterns": [
          "Thanks",
          "Thank you",
          "That's helpful",
          "Awesome, thanks",
          "Thanks for the help",
          "Thank you for helping me"
        ],
        "responses": [
          "You're welcome. Feel free to ask question anytime.",
          "No problem. Please let me know if you have questions.",
          "My pleasure.",
          "Glad to help. Please do not hesitate to ask questions.",
          "Happy I could be of help."
        ]
      },
      {
        "tag": "goodbye",
        "patterns": [
          "Bye",
          "See you later",
          "Goodbye!",
          "Get lost",
          "Till next time",
          "bbye"
        ],
        "responses": ["See you!", "Have a nice day", "Bye! Come back again soon."]
      },
  
      {
        "tag": "about",
        "patterns": ["Who are you?", "What are you?", "Who you are?"],
        "responses": [
          "I'm Sia, your bot assistant.",
          "I'm Sia, an Artificial Intelligent bot."
        ]
      },
      {
        "tag": "name",
        "patterns": [
          "what is your name?",
          "what should i call you?",
          "whats your name?"
        ],
        "responses": ["You can call me Sia.", "I'm Sia!", "Just call me as Sia."]
      },
      {
        "tag": "ucvision",
        "patterns": [
          "university of cebu vision",
          "uc vision",
          "vision",
          "what is the vision of uc?",
          "how about the vision of uc?"
        ],
        "responses": [
          "Democratize quality education.\nBe the visionary and industry leader.\nGive hope and transform lives."
        ]
      },
      {
        "tag": "ucmission",
        "patterns": [
          "university of cebu mission",
          "uc mission",
          "mission",
          "what is the mission of uc?",
          "how about the mission of uc?"
        ],
        "responses": [
          "The University offers affordable and quality education responsive to the demands of local and international communities. The University commits:\n1. To serve as an active catalyst in providing efficient and effective delivery of educational services;\n2. To pursue excellence in instruction, research and community service towards social and economic development as well as environmental sustainability;\n3. To acquire, disseminate and utilize appropriate technology to enhance the University’s educational services; and\n4. To foster an organizational culture that nurtures employee productivity and engagement."
        ]
      },
      {
        "tag": "ucgoal",
        "patterns": [
          "university of cebu goals",
          "uc goals",
          "goals",
          "what are the goals of uc?",
          "how about the goals of uc?"
        ],
        "responses": [
          "1. To offer programs that are relevant, holistic and compliant with institutional, regulatory, industry and accreditation standards that will develop life-long learners;\n2. To develop social awareness, responsibility and accountability among stakeholders anchored on instruction, research, and production;\n3. To complement the academic programs with holistic and integrated student personnel services;\n4. To develop a pool of qualified, professional and motivated faculty in the areas of instruction, research and community extension;\n5. To ensure effective administration and supervision of instructional and learning resources in support of the academic programs;\n6. To provide an environment that is safe, functional, and conducive to teaching, learning and working; and\n7. To ensure collaborative, sustainable, efficient, and effective operations in meeting the needs of the institution and its stakeholders."
        ]
      },
      {
        "tag": "uccorevalue",
        "patterns": [
          "university of cebu core values",
          "uc core values",
          "core values",
          "what are the core values of uc?",
          "how about the core values of uc?"
        ],
        "responses": [
          "The University believes in these core values: 1. INNOVATION Be the visionary and industry leader.\n2. CAMARADERIE Living in the spirit of harmony and approachability.\n3. ALIGNMENT All activities are geared towards core values and priorities.\n4. RESPECT Always a professional, mindful of God, University, community and self.\n5. EXCELLENCE To be great at whatever it is we do and go for the best."
        ]
      },
      {
        "tag": "ucowner",
        "patterns": [
          "who is the owner of UC?",
          "owner of university of cebu",
          "founder of uc?",
          "who owns university of cebu?",
          "university of cebu owner",
          "I would like to know who is the owner of uc?"
        ],
        "responses": [
          "UC is an educational institution in Cebu City, Philippines founded in 1964 by Atty. Augusto W. Go.",
          "University of Cebu is owned by Atty. Augusto W. Go."
        ]
      },
      {
        "tag": "ucaddress",
        "patterns": [
          "What is the school's physical address?",
          "What is the address of the University of Cebu Main?",
          "What is the street address of the school?",
          "Where is the school located?",
          "What is the school's address?",
          "School address",
          "Where can I find the University of Cebu Main? I need the address.",
          "I'd like to know the address of the University of Cebu's main campus, please."
        ],
        "responses": [
          "University of Cebu Main is located at Sanciangko St, Cebu City, 6000 Cebu.",
          "You can find the main campus of the University of Cebu at Sanciangko St, Cebu City.",
          "The address for the main campus of the University of Cebu is Sanciangko St, Cebu City.",
          "The main location of the University of Cebu is at Sanciangko St, Cebu City."
        ]
      },
      {
         "tag": "ucadmissionnewstudent",
         "patterns": [
          "How to enroll as a new student?",
          "How to apply for admission as a new student?",
          "What are the admission requirements as a new student?",
          "What is the admission process like for new students?",
          "New student admission"
         ],
         "responses": [
          "1. NEW STUDENTS. New students are high school graduates enrolling in\nthe University for the first time.\n1.1 At the time of enrollment, a new student must submit his/her\nhigh school report card (Form 138), duly certified by the principal,\nhis/her NSO birth certificate, as well as his/her Certificate of Good\nMoral Character from his/her principal or guidance counselor.\n1.2 Only a graduate of a recognized high school shall be considered\nfor enrollment as a new student.\n1.3 For Maritime courses, the following Department of Health (DOH)\nmedical requirements are annually required: urine, stool, CBC, X-\nray, psychological, eye sight (Ishihara for BSMT and Lantern or any\nother color perception test for BSMARE), and hearing examination\n(per CMO #13, Series 2005); and Hepatitis B Screening."
         ]
      },
      {
          "tag": "ucadmissiontransfereestudent",
          "patterns": [
              "How to enroll as a transferee?",
              "How to apply for admission as a transferee?",
              "What are the admission requirements as a transferee?",
              "What is the admission process like for transferees?",
              "Transferee student admission"
          ],
          "responses": [
              "2. TRANSFER STUDENTS. Transferees are those who wish to enroll in the\nUniversity after having been enrolled in collegiate or technical courses\nin another institution. Transfer students are also those former college\nstudents returning to the University after having enrolled in other\neducational institutions.\n2.1 At the time of enrollment, a transferee must submit the following\ncredentials:\n2.1.1 Certificate of transfer credential from the school last attended;\n2.1.2 Statement of good moral character signed by an adviser\nand certified by the school dean/head and/or the\nstudent affairs director; and\n2.1.3 Informative copy of his/her TOR, which includes the\ndescriptive title of the subjects taken, the number of\nunits and the grades earned.\n2.2 A transferee should have at least 30 units to complete, a grade\npoint average (GPA) of at least 2.5 in all subjects already taken,\nand no more than 2 failures to be admitted. He/she should have\nat least one-year residence in the University prior to graduation.\n2.3 A department may choose to give a validating examination to a\ntransferee whose GPA is below 2.5. Entrance exams administered\nby the Guidance Office is a requirement for the transferee’s\nadmission to the University."
          ]
      },
      {
          "tag": "ucadmissionreturneestudent",
          "patterns": [
              "How to enroll as a returnee?",
              "How to apply for admission as a returnee?",
              "What are the admission requirements as a returnee?",
              "What is the admission process like for returnee?",
              "Returnee student admission"
          ],
          "responses": [
              "3. RETURNEE STUDENTS. Returnee students are those previously\nenrolled in the University either in the immediately preceding\nsemester or after having stopped without enrolling elsewhere.\n3.1 If in any one semester or summer session, a student failed in one-\nthird of the units for which he/she is registered, he/she may not\nenroll in the same program without the written recommendation\nof the college Dean. If the student failed the second time, he/she\nmay enroll in another program if accepted by the Dean of the new\nprogram. If the student failed in similar manner for the third time,\nhe/she shall be disqualified from registration in the University.\n3.2 The disciplinary rules and regulations of the Commission on\nHigher Education (CHEd) and the University govern the non-\nacademic reasons for the non-readmission of a student."
          ]
      },
      {
          "tag": "ucadmissionalienstudent",
          "patterns": [
              "How to enroll as an alien?",
              "How to enroll as a naturalized filipino?",
              "How to enroll as a student with foreign name?",
              "How to apply for admission as an alien?",
              "How to apply for admission as a naturalized filipino?",
              "How to apply for admission as a student with foreign name?",
              "What are the admission requirements as an alien?",
              "What are the admission requirements as a naturalized filipino?",
              "What are the admission requirements as a student with foreign name?",
              "What is the admission process like for aliens?",
              "What is the admission process like for naturalized filipinos?",
              "What is the admission process like for students with foreign name?",
              "Alien student admission",
              "Naturalized student admission",
              "Foreign name student admission"
          ],
          "responses": [
              "4. ALIENS, NATURALIZED FILIPINOS, AND STUDENTS WITH FOREIGN NAMES\n4.1 Philippine-born alien students must submit a photocopy of their\nAlien Certificate of Registration (ACR) and Native-Born Certificate\nof Registration (NBCR), certified against the original by the CHEd\nRegional Office.\n4.2 Children of naturalized Filipino citizens must submit a copy of\nIdentification Certificate issued by the Commissioner of\nImmigration and certified against the original by the CHEd\nRegional Office.\n4.3 Filipino citizens whose family names are of foreign origin must\nsubmit their birth certificates issued by the Local Civil Registrar.\nForeign-born alien students must submit a photocopy of their\nACR, certified against the original by the CHEd Regional Office."
          ]
      },
      {
          "tag": "ucadmissionforeignstudent",
          "patterns": [
              "How to enroll as a foreigner?",
              "How to apply for admission as a foreigner?",
              "What are the admission requirements as a foreigner?",
              "What is the admission process like for a foreigner?",
              "Foreign student admission"
          ],
          "responses": [
              "5. FOREIGN STUDENTS\n5.1 For overseas students, who are still abroad, they may apply for\nadmission in writing with the University Registrar and submit the\nfollowing admission requirements:\n5.1.1 Six (6) copies of the duly accomplished Personal History\nStatements (PHS) signed in English and in his/her\nnational alphabet. PHS form is available at the Philippine\nForeign Services Post (PFSP) in the applicant’s home\ncountry;\n5.1.2 Six (6) copies of the original Transcript of Scholastic\nRecords duly authenticated by the PFSP in the student’s\ncountry of origin or legal residence;\n5.1.3 Six (6) copies of the notarized Affidavit of Adequate\nFinancial Support (AAFS) including bank accounts or\nnotarized Notice of Grant for institutional scholars to\ncover expenses for the student’s accommodation and\nsubsistence as well as school dues or other incidental\nexpenses;\n5.1.4 Six (6) copies of the data page of the applicant’s passport\nshowing the date and place of birth, duly authenticated\nby the PFSP in the applicant’s country of origin or legal\nresidence; and\n5.1.5 Remittance of Acceptance Fee of US$ 120.00 to cover the\nissuance of Notice of Acceptance (NOA), handling and\nmailing of the above documents to the Philippine\nDepartment of Foreign Affairs (DFA) and mailing of a\ncopy of NOA to the applicant.\n5.1.6 The DFA needs the above-mentioned documents to\nprocess the issuance of a Student Visa.\n5.2 For foreign students, who are already in the Philippines under any\nvisa category, may apply in the Bureau of Immigration (BoI) for\nthe change/conversion of his/her admission status to that of a\nstudent under Section 9(f) of the Philippine Immigration Act of\n1940, as amended pursuant to Executive Order No. 285. Requirements:\n5.2.1 Written endorsement from the University Registrar;\n5.2.2 NOA;\n5.2.3 Six (6) copies of the notarized proof of AAFS to cover\nexpenses for the student’s accommodation andsubsistence as well as school dues and other incidental\nexpenses;\n5.2.4 Six (6) copies of the original Transcript of Scholastic\nRecords, duly authenticated by the PFSP in the student’s\ncountry of origin or legal residence;\n5.2.5 Six (6) copies of the Police Clearance Certificate issued by\nthe national police authorities in the student’s country of\norigin or legal residence, duly authenticated by the PFSP\nhaving consular jurisdiction over the place for a student\nwho resided in the Philippine for less than 59 days.\nHowever, for students who resided in the Philippines for\nmore than 59 days at the time he/she applies for said\nchange/conversion of his/her admission status to that of\na student, he/she shall also be required to submit the\nNational Bureau of Investigation (NBI) clearance;\n5.2.6 Six (6) copies of the Quarantine Medical Examination\nCertificate issued by the National Quarantine Office;\n5.2.7 Six (6) copies of student’s PHS, signed by the student\nwith a 2x2-inch recently taken photograph;\n5.2.8 Six (6) copies of the data page of the applicant’s passport\nand the stamp of the latest arrival; the passport itself\nshall be presented for verification; and\n5.2.9 Remittance of Acceptance Fee of US$ 120.00 to cover the\nissuance of NOA, handling, and mailing of the above\ndocuments to the BoI, Manila.\n5.3 For foreign students who wish to transfer from one Philippine\nhigher educational institution (HEI) to another, the requirements\nare:\n5.3.1 NOA from accepting school;\n5.3.2 Letter of No Objection issued by the BoI; and\n5.3.3 Certificate of Transfer Credentials and Certificate of Good\nMoral Character issued by the previous school.\n5.4 Scheduling of Processing of Student Visa:\n5.4.1 For first semester applicants: January 1 to April 15\n5.4.2 For second semester applicants: June 1 to September 15\n5.4.3 For summer classes applicants: December 1 to January 31\n5.5 In accordance with the regulations of CHEd and other government\nagencies supervising foreign students, no foreign student may be\nallowed to enroll unless he/she can submit a valid permit to study\nand a student’s visa to the Foreign Students Section of the\nUniversity Registrar."
          ]
      },
      {
          "tag": "ucadmissionspecialstudent",
          "patterns": [
              "How to enroll as a special student?",
              "How to apply for admission as a special student?",
              "What are the admission requirements as a special student?",
              "What is the admission process like for a special student?",
              "Special student admission"
          ],
          "responses": [
              "6. SPECIAL STUDENTS. Special students are those who are not entitled to\nreceive official credit for work, which they desire to take because they\ndo not satisfy the requirements for admission to the courses or\nsubjects or for any other reason. Special students may be admitted at\nany time to the course they wish to attend provided that:\n6.1 They receive approval from the Dean and/or department\nChairperson for each of the course they intend to participate in;\n6.2 They sign an agreement that they waive the right to receive and\nto demand credit for the work done [Section VIII, par. 144,\nManual of Regulations for Private School (MORPS), 1970, 7th\nedition] and that they pay in full the fees at the time of\nenrollment; and\n6.3 Special students are not eligible for any honors or privileges."
          ]
      },
      {
          "tag": "ucadmissiongraduatestudent",
          "patterns": [
              "How to enroll as a graduate student?",
              "How to apply for admission as a graduate student?",
              "What are the admission requirements as a graduate student?",
              "What is the admission process like for a graduate student?",
              "Graduate student admission"
          ]
      },
      {
          "tag": "ucacademicprograms",
          "patterns": [
              "What are the available academic programs in uc main?",
              "Academic programs",
              "What are the programs offered in uc main?",
              "Programs offered"
          ],
          "responses": [
              "Academic Programs:\n1. College of Arts\n2. College of Business and Accountancy\n3. College of Criminology\n4. College of Computer Engineering\n5. College of Information and Computer Studies\n6. College of Customs Administration\n7. College of Engineering\n8. College of Education\n9. College of Hotel and Restaurant Management\n10. College of Law\n11. College of Maritime Education\n12. College of Nursing\n13. College of Tourism\n14. School of Midwifery\n15. Graduate School"
          ]
      },
      {
          "tag": "uccollegeofarts",
          "patterns": [
              "What can you major in college of arts?",
              "College of arts",
              "Bachelor of arts majors",
              "COA majors"
          ],
          "responses": [
              "1.1 Bachelor of Arts major in: 1.1.1 English\n1.1.2. Psychology\n1.1.3. Political Science"
          ]
      },
      {
          "tag": "uccollegeofbusinessandaccountancy",
          "patterns": [
              "What can you major in college of business and accountancy?",
              "College of business and accountancy",
              "Bachelor of Science in Business Administration majors",
              "BSBA majors"
          ],
          "responses": [
              "2.1 Bachelor of Science in Business Administration major in:\n 2.1.1 Financial Management\n2.1.2 Human Resource Development Management\n2.1.3 Management Accounting\n 2.1.4 Marketing Management\n2.1.5 Office Administration\n2.1.5.1 Associate in Office Administration\n2.2 Bachelor of Science in Real Estate Management\n2.3 Bachelor of Science in Accountancy\n2.4 Bachelor of Science in Accounting Technology\n2.4.1 Associate in Accounting Technology"
          ]
      },
      {
          "tag": "uccollegeofcriminology",
          "patterns": [
              "What can you major in college of criminology?",
              "College of criminology",
              "Bachelor of Science in Criminology majors",
              "BSCrim majors"
          ],
          "responses": [
              "3.1 Bachelor of Science in Criminology"
          ]
      },
      {
          "tag": "uccollegeofcomputerengineering",
          "patterns": [
              "What can you major in college of computer engineering?",
              "College of engineering",
              "Bachelor of Science in Computer Engineering majors",
              "BS Com Eng majors"
          ],
          "responses": [
              "4.1 Bachelor of Science in Computer Engineering\n4.1.1 Associate in Computer Engineering"
          ]
      },
      {
          "tag": "ucinformationandcomputerstudies",
          "patterns": [
              "What can you major in college of information and computer studies?",
              "College of information and computer studies",
              "Bachelor of Science in Information technology majors",
              "Bachelor of Science in IT majors",
              "Bachelor of Science in Computer Science majors",
              "BSCS majors",
              "BSIT majors"
          ],
          "responses": [
              "5.1 Bachelor of Science in Information Technology\n5.2 Bachelor of Science in Information System\n5.2.1 Associate in Information System\n5.3 Associate in Computer Technology (Programming)\n5.4 Associate in Computer Technology major in Animation"
          ]
      },
      {
          "tag": "uccollegeofcustomsadministration",
          "patterns": [
              "What can you major in college of customs administration?",
              "College of customs administration",
              "Bachelor of Science in Customs Administration majors",
              "BSCA majors"
          ],
          "responses": [
              "6.1 Bachelor of Science in Customs Administration"
          ]
      },
      {
          "tag": "uccollegeofengineering",
          "patterns": [
              "What can you major in college of engineering?",
              "College of engineering",
              "Bachelor of Science in Engineering majors",
              "COE majors"
          ],
          "responses": [
              "7.1 Bachelor of Science in Civil Engineering\n7.2 Bachelor of Science in Electrical Engineering\n7.3 Bachelor of Science in Electronics and Communications Engineering\n7.4 Bachelor of Science in Industrial Engineering\n7.5 Bachelor of Science in Mechanical Engineering\n7.6 Bachelor of Science in Naval Architecture and Marine Engineering"
          ]
      },
      {
          "tag": "uccollegeofeducation",
          "patterns": [
              "What can you major in college of education?",
              "College of education",
              "Bachelor of Science in Education majors",
              "COEd majors"
          ],
          "responses": [
              "8.1 Bachelor of Elementary Education\n8.1.1 General Education\n8.1.2 Special Education\n8.2 Bachelor of Secondary Education major in:\n8.2.1 Biological Science\n8.2.2 English\n8.2.3 Filipino\n8.2.4 MAPEH\n8.2.5 Mathematics\n8.2.6 Physical Science\n8.2.7 Social Science"
          ]
      },
      {
          "tag": "uccollegeofhotelandrestaurantmanagement",
          "patterns": [
              "What can you major in college of hotel and restaurant management?",
              "College of hotel and restaurant management",
              "Bachelor of Science in Hotel and restaurant management majors",
              "BS HRM majors"
          ],
          "responses": [
              "9.1 Bachelor of Science in Hotel and Restaurant Management\n9.1.1 Associate in Hotel and Restaurant Management"
          ]
      },
      {
          "tag": "uccollegeoflaw",
          "patterns": [
              "What can you major in college of law?",
              "College of Law",
              "CL majors"
          ],
          "responses": [
              "10.1 Juris Doctor"
          ]
      },
      {
          "tag": "uccollegeofmaritimeeducation",
          "patterns": [
              "What can you major in college of maritime education?",
              "College of maritime education",
              "BSMarE majors"
          ],
          "responses": [
              "11.1 Bachelor of Science in Marine Engineering\n11.2 Bachelor of Science in Marine Transportation\n11.3 Catering and Stewarding Services"
          ]
      },
      {
          "tag": "uccollegeofnursing",
          "patterns": [
              "What can you major in college of nursing?",
              "College of nursing",
              "CON majors"
          ],
          "responses": [
              "12.1 Bachelor of Science in Nursing\n12.2 Health Care Services"
          ]
      },
      {
          "tag": "uccollegeoftourism",
          "patterns": [
              "What can you major in college of tourism?",
              "College of tourism",
              "COT majors"
          ],
          "responses": [
              "13.1 Bachelor of Science in Tourism"
          ]
      },
      {
          "tag": "ucschoolofmidwifery",
          "patterns": [
              "What can you major in School of midwifery?",
              "School of midwifery",
              "SOM majors"
          ],
          "responses": [
              "14.1 Diploma in Midwifery"
          ]
      },
      {
          "tag": "ucgraduateschool",
          "patterns": [
              "What can you major in graduate school?",
              "Graduate school",
              "GRS majors"
          ],
          "responses": [
              "15.1 Doctor of Education major in:\n15.1.1 Educational Leadership and Management\n15.1.2 Institutional Planning\n15.2 Master of Arts in Nursing major in:\n15.2.1 Community Health Nursing\n15.2.2 Maternal and Child Nursing\n15.2.3 Medical-Surgical Nursing\n15.2.4 Nursing Administration\n15.2.5 Psychiatric Nursing\n15.3 Master of Business Administration\n15.3.1 Thesal\n15.3.2 Non-thesal\n15.3.2.1 Financial Management\n15.3.2.2 Hotel and Restaurant Management\n15.3.2.3 Human Resource Management and Development\n15.4 Master of Science in Criminal Justice\n15.5 Master of Science in Elementary Management\n15.6 Master in Science Teaching major in:\n15.6.1 Computer Studies\n15.6.2 Educational Technology\n15.6.3 English Language and Literature\n15.6.4 Filipino\n15.6.5 Makabayan\n15.6.6 Marine and Nautical Sciences\n15.6.7 Mathematics\n15.6.8 Science"
          ]
      }
    ]
  }